RIET/src/InformationRegisters/DutiesRechargeParameters/DutiesRechargeParameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DutiesRechargeParameters</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <resources>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SubAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/DutiesRechargeParameters/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		РГСофтКлиентСервер.УстановитьЗначение(Запись.Account, СокрЛП(Запись.Account));
		РГСофтКлиентСервер.УстановитьЗначение(Запись.SubAccount, СокрЛП(Запись.SubAccount));
		
		Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Start date"" is empty!",
				, "Период", "Запись", Отказ);			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.AU) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""AU"" is empty!",
				, "AU", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.Account) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Account"" is empty!",
				, "Account", "Запись", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
